[
	{
		"name": "Imperial College London",
		"url": "https://www.imperial.ac.uk/",
		"subtitle": "MEng Computing",
		"dates": "2017-2021",
		"desc": "Uni has been a great place for me to explore my love for Computing in more depth. If you'd have told me a few years ago the type of stuff I'd be doing now, well I mean I'd probably have believed you, since I've always enjoyed it. However, I've managed to do things such as creating a life-size arcade machine for the game Snake, to building an operating system, to creating my own programming language, and recently making an app researching technologies which had never been used before in that context!\n One very cool part of being at Imperial is the amount of group projects we get to work on. These range greatly in scale, from small Robotics projects, up to massive industry-scale webapps. These are the best part of my course, and you can see some of the awesome things we've come up with on my projects page! \n You can see below some of the achievements me and my groups have received whilst being at uni, and I hope to keep working on projects long after I finish my degree.\n I'm also a member of the Skydiving Society and Golf Society at Imperial - you can find more out about these on the 'Me' page.",
		"badges":["1st - First Year", "1st - Second Year", "1st - Third Year"],
		"highlights":[
			{
				"name": "Models of Computation Exam",
				"score": "First (97.2%)"
			},
			{
				"name": "WACC Project",
				"score": "First (96.4%)"
			}
		],
		"commendations": [
			{
				"name": "Best Group Project on Medical Imaging",
				"awarder": "Dr Konstantinos Gkoutzis",
				"date": "March 2018"
			},
			{
				"name": "Best C Group Project Extension",
				"awarder": "Dr Konstantinos Gkoutzis",
				"date": "June 2018"
			},
			{
				"name": "Runner-Up WebApps Group Project",
				"awarder": "Dr Mark Wheelhouse",
				"date": "June 2019"
			}
		]
	},
	{
		"name": "Westcliff High School for Boys",
		"subtitle" : "A Levels",
		"desc": "I had a great time at WHSB whilst I was studying for my A Levels. I moved here because my old school didn't offer Computer Science as an A Level, and I thought it was what I wanted to pursue. However, thanks to my Computing teacher (should out Mr Rahman), I knew it was for me. \n I started working on some programming projects whilst I was here (you can see one attempt on my projects page, if you can call it that), but I knew that I just wanted to keep trying and get better. \n At Sixth Form, I was a prefect, and helped to tutor maths students in the lower years, because I wanted to give back to the community which helped me so much.",
		"dates": "2015-2017",
		"badges":["A* Maths", "A* Further Maths", "A* Computing", "A* Physics", "A EPQ"],
		"commendations": [
			{
				"name": "Bebras Challenge Finalist",
				"awarder": "University of Oxford",
				"date": 2016
			}
		],
		"highlights":[
			{
				"name": "UKMT Senior Mathematics Challenge",
				"score": "Gold"
			}, 
			{
				"name": "Prefect"
			}
		]
	},
	{
		"name": "The Billericay School",
		"subtitle" : "GCSEs",
		"desc": "If you've made it this far, then you really are doing a thorough search. Back in school, I wasn't really sure what I wanted to do. To be honest, I didn't really know what Computing was. It wasn't until I was choosing my GCSEs that I saw it was an option. Speaking to my ICT teacher, she told me she didn't think I'd be able to handle Computing, so I decided to prove her wrong. So yes, I am where I am today out of pure spite. However, I do have to thank her, because I think it's been quite successful this far. \n  ",
		"dates": "2010-2015",
		"badges":["A* x 6", "A x 5"],
		"commendations": [
			{
				"name": "Outstanding Achievement Award",
				"awarder": "Mrs Sue Hammond",
				"date": 2011
			},
			{
				"name": "Best in Year:",
				"awarder" : "UKMT Intermediate Mathematics Challenge",
				"date": 2014
			}
		]
	},
	{
		"name": "ABRSM",
		"subtitle" : "Music Exams",
		"dates": "2012-2017",
		"desc": "Outside of Computing, I also enjoy playing the piano. When I was younger, I used to take lessons towards earning my grades, which can be seen here, however since I've started uni, I now do it more in my free time. \nIn my third year, I took a course called 'Music Technology', where I got to learn about different ways of producing music, and got to revive some of my piano playing skills!",
		"final":true,
		"badges":["Grade 4 Piano"],
		"commendations": [
			{
				"name": "Grade 4 Piano Merit",
				"awarder": "ABRSM",
				"date": "2017"
			} 
		
			
		]
	}
]